In [2]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline
import matplotlib
matplotlib.rcParams["figure.figsize"] = (20,10)

In [4]:
df = pd.read_csv("Downloads/Bengaluru_house_prices.csv")
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [5]:
df.shape

(13320, 9)

In [6]:
df.groupby('area_type')['area_type'].agg('count')

area_type
Built-up  Area          2418
Carpet  Area              87
Plot  Area              2025
Super built-up  Area    8790
Name: area_type, dtype: int64

In [7]:
df1 = df.drop(['area_type','society','balcony','availability'],axis='columns')
df1.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [8]:
df1.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [9]:
df2 = df1.dropna()
df2.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [10]:
df2.shape

(13246, 5)

In [11]:
df2['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [12]:
df2['bhk'] = df2['size'].apply(lambda x: int(x.split(' ')[0]))

C:\Users\lenovo\AppData\Local\Temp\ipykernel_15656\1142257054.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['bhk'] = df2['size'].apply(lambda x: int(x.split(' ')[0]))

In [13]:
df2.head()

                   location       size total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK       1056   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00    4
2               Uttarahalli      3 BHK       1440   2.0   62.00    3
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00    3
4                  Kothanur      2 BHK       1200   2.0   51.00    2

In [15]:
df2['bhk'].unique()

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18])

In [16]:
df2[df2.bhk>20]

                       location        size total_sqft  bath  price  bhk
1718  2Electronic City Phase II      27 BHK       8000  27.0  230.0   27
4684                Munnekollal  43 Bedroom       2400  40.0  660.0   43

In [17]:
df2.total_sqft.unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [18]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [20]:
df2[~df2['total_sqft'].apply(is_float)].head(10)

               location       size      total_sqft  bath    price  bhk
30            Yelahanka      4 BHK     2100 - 2850   4.0  186.000    4
122              Hebbal      4 BHK     3067 - 8156   4.0  477.000    4
137  8th Phase JP Nagar      2 BHK     1042 - 1105   2.0   54.005    2
165            Sarjapur      2 BHK     1145 - 1340   2.0   43.490    2
188            KR Puram      2 BHK     1015 - 1540   2.0   56.800    2
410             Kengeri      1 BHK  34.46Sq. Meter   1.0   18.500    1
549         Hennur Road      2 BHK     1195 - 1440   2.0   63.770    2
648             Arekere  9 Bedroom       4125Perch   9.0  265.000    9
661           Yelahanka      2 BHK     1120 - 1145   2.0   48.130    2
672        Bettahalsoor  4 Bedroom     3090 - 5002   4.0  445.000    4

In [39]:
def convert_sqft_to_num(x):
    try:
        # Remove unwanted text and whitespace
        x = x.lower().replace('sqft', '').replace('sq. ft.', '').replace('sq. ft', '')
        x = x.replace('total_sqft', '').strip()

        # If it's a range like "2100 - 2850"
        if '-' in x:
            tokens = x.split('-')
            if len(tokens) == 2:
                return (float(tokens[0].strip()) + float(tokens[1].strip())) / 2
        
        # If it's a single number like "2100"
        return float(x)
    
    except:
        return None

In [40]:
convert_sqft_to_num('2166')

2166.0

In [41]:
convert_sqft_to_num('2100 - 2850')

2475.0

In [42]:
df3 = df2.copy()
df3['total_sqft'] = df3['total_sqft'].apply(convert_sqft_to_num)
df3.head(3)

                   location       size  total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK      1056.0   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00    4
2               Uttarahalli      3 BHK      1440.0   2.0   62.00    3

In [44]:
df3.loc[20]

location      Kengeri
size            1 BHK
total_sqft      600.0
bath              1.0
price            15.0
bhk                 1
Name: 20, dtype: object

In [45]:
df3.head()

                   location       size  total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK      1056.0   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00    4
2               Uttarahalli      3 BHK      1440.0   2.0   62.00    3
3        Lingadheeranahalli      3 BHK      1521.0   3.0   95.00    3
4                  Kothanur      2 BHK      1200.0   2.0   51.00    2

In [48]:
df4 = df3.copy()
df4['price_per_sqft'] = df4['price']*100000/df4['total_sqft']
df4.head()

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000

In [50]:
len(df4.location.unique())

1304

In [51]:
df4.location = df4.location.apply(lambda x: x.strip())
location_stats = df4.groupby('location')['location'].agg('count')
location_stats

location
1 Annasandrapalya                                  1
1 Giri Nagar                                       1
1 Immadihalli                                      1
1 Ramamurthy Nagar                                 1
12th cross srinivas nagar banshankari 3rd stage    1
                                                  ..
t.c palya                                          1
tc.palya                                           4
vinayakanagar                                      1
white field,kadugodi                               1
whitefiled                                         1
Name: location, Length: 1293, dtype: int64

In [53]:
len(df4.location.unique())

1293

In [57]:
# Get location counts
location_counts = df4['location'].value_counts()

# Filter locations that occur less than 10 times
location_state_less_than_10 = location_counts[location_counts < 10].index

In [58]:
# Step 1: Get counts
location_counts = df4['location'].value_counts()

# Step 2: Get locations with < 10 occurrences
location_state_less_than_10 = location_counts[location_counts < 10].index

# Step 3: Replace those with 'other'
df4['location'] = df4['location'].apply(lambda x: 'other' if x in location_state_less_than_10 else x)

# Optional: Check unique values
print(df4['location'].unique())

['Electronic City Phase II' 'Chikka Tirupathi' 'Uttarahalli'
 'Lingadheeranahalli' 'Kothanur' 'Whitefield' 'Old Airport Road'
 'Rajaji Nagar' 'Marathahalli' 'other' '7th Phase JP Nagar' 'Gottigere'
 'Sarjapur' 'Mysore Road' 'Bisuvanahalli' 'Raja Rajeshwari Nagar'
 'Kengeri' 'Binny Pete' 'Thanisandra' 'Bellandur' 'Electronic City'
 'Ramagondanahalli' 'Yelahanka' 'Hebbal' 'Kasturi Nagar' 'Kanakpura Road'
 'Electronics City Phase 1' 'Kundalahalli' 'Chikkalasandra'
 'Murugeshpalya' 'Sarjapur  Road' 'Ganga Nagar' 'HSR Layout'
 'Doddathoguru' 'KR Puram' 'Bhoganhalli' 'Lakshminarayana Pura'
 'Begur Road' 'Varthur' 'Bommanahalli' 'Gunjur' 'Devarachikkanahalli'
 'Hegde Nagar' 'Haralur Road' 'Hennur Road' 'Kothannur' 'Kalena Agrahara'
 'Kaval Byrasandra' 'ISRO Layout' 'Garudachar Palya' 'EPIP Zone'
 'Dasanapura' 'Kasavanhalli' 'Sanjay nagar' 'Domlur'
 'Sarjapura - Attibele Road' 'Yeshwanthpur' 'Chandapura' 'Nagarbhavi'
 'Devanahalli' 'Ramamurthy Nagar' 'Malleshwaram' 'Akshaya Nagar'
 'Shampura' 'Kadugodi' 'LB Shastri Nagar' 'Hormavu' 'Vishwapriya Layout'
 'Kudlu Gate' '8th Phase JP Nagar' 'Bommasandra Industrial Area'
 'Anandapura' 'Vishveshwarya Layout' 'Kengeri Satellite Town'
 'Kannamangala' 'Hulimavu' 'Mahalakshmi Layout' 'Hosa Road' 'Attibele'
 'CV Raman Nagar' 'Kumaraswami Layout' 'Nagavara' 'Hebbal Kempapura'
 'Vijayanagar' 'Pattandur Agrahara' 'Nagasandra' 'Kogilu' 'Panathur'
 'Padmanabhanagar' '1st Block Jayanagar' 'Kammasandra' 'Dasarahalli'
 'Magadi Road' 'Koramangala' 'Dommasandra' 'Budigere' 'Kalyan nagar'
 'OMBR Layout' 'Horamavu Agara' 'Ambedkar Nagar' 'Talaghattapura'
 'Balagere' 'Jigani' 'Gollarapalya Hosahalli' 'Old Madras Road'
 'Kaggadasapura' '9th Phase JP Nagar' 'Jakkur' 'TC Palaya' 'Giri Nagar'
 'Singasandra' 'AECS Layout' 'Mallasandra' 'Begur' 'JP Nagar'
 'Malleshpalya' 'Munnekollal' 'Kaggalipura' '6th Phase JP Nagar' 'Ulsoor'
 'Thigalarapalya' 'Somasundara Palya' 'Basaveshwara Nagar' 'Bommasandra'
 'Ardendale' 'Harlur' 'Kodihalli' 'Narayanapura' 'Bannerghatta Road'
 'Hennur' '5th Phase JP Nagar' 'Kodigehaali' 'Billekahalli' 'Jalahalli'
 'Mahadevpura' 'Anekal' 'Sompura' 'Dodda Nekkundi' 'Hosur Road'
 'Battarahalli' 'Sultan Palaya' 'Ambalipura' 'Hoodi' 'Brookefield'
 'Yelenahalli' 'Vittasandra' '2nd Stage Nagarbhavi' 'Vidyaranyapura'
 'Amruthahalli' 'Kodigehalli' 'Subramanyapura' 'Basavangudi'
 'Kenchenahalli' 'Banjara Layout' 'Kereguddadahalli' 'Kambipura'
 'Banashankari Stage III' 'Sector 7 HSR Layout' 'Rajiv Nagar' 'Arekere'
 'Mico Layout' 'Kammanahalli' 'Banashankari' 'Chikkabanavar' 'HRBR Layout'
 'Nehru Nagar' 'Kanakapura' 'Konanakunte' 'Margondanahalli' 'R.T. Nagar'
 'Tumkur Road' 'Vasanthapura' 'GM Palaya' 'Jalahalli East' 'Hosakerehalli'
 'Indira Nagar' 'Kodichikkanahalli' 'Varthur Road' 'Anjanapura' 'Abbigere'
 'Tindlu' 'Gubbalala' 'Dairy Circle' 'Parappana Agrahara'
 'Cunningham Road' 'Kudlu' 'Banashankari Stage VI' 'Cox Town'
 'Kathriguppe' 'HBR Layout' 'Yelahanka New Town' 'Sahakara Nagar'
 'Rachenahalli' 'Sadashiva Nagar' 'Yelachenahalli' 'Green Glen Layout'
 'Thubarahalli' 'Naganathapura' 'Horamavu Banaswadi' '1st Phase JP Nagar'
 'NGR Layout' 'Seegehalli' 'BEML Layout' 'NRI Layout' 'ITPL'
 'Babusapalaya' 'Nagappa Reddy Layout' 'BTM 1st Stage' 'Iblur Village'
 'Ananth Nagar' 'Basapura' 'Channasandra' 'Sector 1 HSR Layout'
 'Choodasandra' 'Kaikondrahalli' 'Neeladri Nagar' 'Frazer Town'
 'Cooke Town' 'Doddakallasandra' 'Chamrajpet' 'Rayasandra' 'Kalkere'
 '5th Block Hbr Layout' 'Pai Layout' 'Banashankari Stage V' 'Sonnenahalli'
 'Benson Town' '2nd Phase Judicial Layout' 'Poorna Pragna Layout'
 'Judicial Layout' 'Banashankari Stage II' 'Karuna Nagar' 'Bannerghatta'
 'Marsur' 'Bommenahalli' 'Laggere' 'Prithvi Layout' 'Banaswadi'
 'Sector 2 HSR Layout' 'Shivaji Nagar' 'Badavala Nagar' 'Nagavarapalya'
 'BTM Layout' 'BTM 2nd Stage' '1st Block Koramangala' 'Hoskote'
 'Doddaballapur' 'Gunjur Palya' 'Sarakki Nagar' 'Thyagaraja Nagar'
 'Bharathi Nagar' 'Dodsworth Layout' 'HAL 2nd Stage' 'Kadubeesanahalli'
 'Nagadevanahalli']

In [60]:
len(df4.location.unique())

255

In [61]:
df4.head(10)

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000
5,Whitefield,2 BHK,1170.0,2.0,38.00,2,3247.863248
6,Old Airport Road,4 BHK,2732.0,4.0,204.00,4,7467.057101
7,Rajaji Nagar,4 BHK,3300.0,4.0,600.00,4,18181.818182
8,Marathahalli,3 BHK,1310.0,3.0,63.25,3,4828.244275
9,other,6 Bedroom,1020.0,6.0,370.00,6,36274.509804

In [62]:
df4[df4.total_sqft/df4.bhk<300].head()

,location,size,total_sqft,bath,price,bhk,price_per_sqft
9,other,6 Bedroom,1020.0,6.0,370.0,6,36274.509804
45,HSR Layout,8 Bedroom,600.0,9.0,200.0,8,33333.333333
58,Murugeshpalya,6 Bedroom,1407.0,4.0,150.0,6,10660.980810
68,Devarachikkanahalli,8 Bedroom,1350.0,7.0,85.0,8,6296.296296
70,other,3 Bedroom,500.0,3.0,100.0,3,20000.000000

In [64]:
df4.shape

(13246, 7)

In [66]:
df5 = df4[~(df4.total_sqft/df4.bhk<300)]
df5.shape

(12502, 7)

In [67]:
df5.price_per_sqft.describe()

count     12456.000000
mean       6308.502826
std        4168.127339
min         267.829813
25%        4210.526316
50%        5294.117647
75%        6916.666667
max      176470.588235
Name: price_per_sqft, dtype: float64